/**
 * 서비스 정보 데이터
 * key: 검색어에서 감지할 단어
 * value: 필터링에 사용할 키워드 배열
 */

export const SERVICE_DICT: Record<string, string[]> = {
  레슨: ["레슨"],
  수업: ["레슨"],
  강습: ["레슨"],
  강의: ["레슨"],
  배우고싶어: ["레슨"],
  배우고: ["레슨"],
  가르쳐줘: ["레슨"],
  찾아줘: [],
  찾고싶어: [],
  근처에서: [],
  합주: ["밴드", "합주"],
  밴드: ["밴드", "합주"],
  모임: ["밴드", "합주"],
  같이: ["밴드", "합주"],
  연주: ["밴드", "합주"],
  구인: ["밴드", "합주"],
  구직: ["밴드", "합주"],
  중고: ["악기거래", "음향장비"],
  거래: ["악기거래", "음향장비"],
  악기: ["악기거래"],
  장비: ["음향장비", "악기거래"],
  삽니다: ["악기거래", "음향장비"],
  팝니다: ["악기거래", "음향장비"],
  음향장비: ["음향장비"],
};
